export interface NewsItem {
  id: string;
  title: string;
  summary: string;
  date: string;
  source: string;
  tag: string;
  tagColor: string;
}

export const hotNews: NewsItem[] = [
  {
    "id": "n-1791946230669-0",
    "title": "出了！27国考职位表正式下发！ 共计招录35691人祝大家都能找到心仪岗位！ #国考[超话]##国考##决战公考# ​",
    "summary": "出了！27国考职位表正式下发！ 共计招录35691人祝大家都能找到心仪岗位！ #国考[超话]##国考##决战公考# ​  手机新浪网",
    "date": "2026-10-13",
    "source": "综合报道",
    "tag": "招录动态",
    "tagColor": "bg-red-100 text-red-700"
  },
  {
    "id": "n-1791946230981-40",
    "title": "国考报名今开始：拟招3.57万人，打击“公考围岗”",
    "summary": "国考报名今开始：拟招3.57万人，打击“公考围岗”  中国新闻网",
    "date": "2026-10-13",
    "source": "综合报道",
    "tag": "招录动态",
    "tagColor": "bg-red-100 text-red-700"
  },
  {
    "id": "n-1791946230981-41",
    "title": "中央机关及其直属机构2027年度考试录用公务员报名即将开始",
    "summary": "中央机关及其直属机构2027年度考试录用公务员报名即将开始  新华网",
    "date": "2026-10-13",
    "source": "综合报道",
    "tag": "招录动态",
    "tagColor": "bg-red-100 text-red-700"
  },
  {
    "id": "n-1791946230981-42",
    "title": "2027国考今起报名 首提严打“公考围岗”、招录向基层倾斜",
    "summary": "2027国考今起报名 首提严打“公考围岗”、招录向基层倾斜  央视网",
    "date": "2026-10-13",
    "source": "综合报道",
    "tag": "招录动态",
    "tagColor": "bg-red-100 text-red-700"
  },
  {
    "id": "n-1791946230981-43",
    "title": "国考10月14日起报名！首提严打“公考围岗”、招录向基层倾斜",
    "summary": "国考10月14日起报名！首提严打“公考围岗”、招录向基层倾斜  京报网",
    "date": "2026-10-13",
    "source": "综合报道",
    "tag": "招录动态",
    "tagColor": "bg-red-100 text-red-700"
  },
  {
    "id": "n-1791946230981-44",
    "title": "2027年国考缩招，新举措防范“公考围岗”舞弊行为",
    "summary": "2027年国考缩招，新举措防范“公考围岗”舞弊行为  东方财富",
    "date": "2026-10-13",
    "source": "综合报道",
    "tag": "招录动态",
    "tagColor": "bg-red-100 text-red-700"
  },
  {
    "id": "n-1791946230981-45",
    "title": "打击“公考围岗”，国考报名需要实名实人认证",
    "summary": "打击“公考围岗”，国考报名需要实名实人认证  中国新闻网",
    "date": "2026-10-13",
    "source": "综合报道",
    "tag": "招录动态",
    "tagColor": "bg-red-100 text-red-700"
  },
  {
    "id": "n-1791946230981-46",
    "title": "2027国考今起报名，关键时间、注意事项一文速览",
    "summary": "2027国考今起报名，关键时间、注意事项一文速览  ThePaper.cn",
    "date": "2026-10-13",
    "source": "综合报道",
    "tag": "招录动态",
    "tagColor": "bg-red-100 text-red-700"
  }
];
