export interface NewsItem {
  id: string;
  title: string;
  summary: string;
  date: string;
  source: string;
  tag: string;
  tagColor: string;
}

export const hotNews: NewsItem[] = [
  {
    "id": "n-1792550299820-73",
    "title": "国考10月14日起报名！首提严打“公考围岗”、招录向基层倾斜 #国考今起报名（中央广播电视总台中国之声、中国新闻网）",
    "summary": "国考10月14日起报名！首提严打“公考围岗”、招录向基层倾斜 #国考今起报名（中央广播电视总台中国之声、中国新闻网）  搜狐",
    "date": "2026-10-17",
    "source": "综合报道",
    "tag": "招录动态",
    "tagColor": "bg-red-100 text-red-700"
  },
  {
    "id": "n-1792550299820-78",
    "title": "2027 国考报名开启，3.57 万人计划招录，10 月 14 日启动",
    "summary": "2027 国考报名开启，3.57 万人计划招录，10 月 14 日启动|国家公务员局|新华社|2027 国考_新浪新闻  手机新浪网",
    "date": "2026-10-17",
    "source": "综合报道",
    "tag": "招录动态",
    "tagColor": "bg-red-100 text-red-700"
  },
  {
    "id": "n-1792550299820-59",
    "title": "国考报名首日总报名人数达20.9万人，出现“千里挑一”岗位",
    "summary": "国考报名首日总报名人数达20.9万人，出现“千里挑一”岗位  京报网",
    "date": "2026-10-16",
    "source": "综合报道",
    "tag": "招录动态",
    "tagColor": "bg-red-100 text-red-700"
  },
  {
    "id": "n-1792550299820-61",
    "title": "国考报名开始，莫给“公考围岗”可乘之机",
    "summary": "国考报名开始，莫给“公考围岗”可乘之机  搜狐网",
    "date": "2026-10-15",
    "source": "综合报道",
    "tag": "招录动态",
    "tagColor": "bg-red-100 text-red-700"
  },
  {
    "id": "n-1792550299820-64",
    "title": "公务员考试，虚假报名700次，盗取5000条公民信息",
    "summary": "公务员考试，虚假报名700次，盗取5000条公民信息  搜狐网",
    "date": "2026-10-15",
    "source": "综合报道",
    "tag": "招录动态",
    "tagColor": "bg-red-100 text-red-700"
  },
  {
    "id": "n-1792550299820-90",
    "title": "扬州65个岗位招110人！“国考”今起报名，新增“实名实人”认证",
    "summary": "扬州65个岗位招110人！“国考”今起报名，新增“实名实人”认证  凤凰网",
    "date": "2026-10-15",
    "source": "综合报道",
    "tag": "招录动态",
    "tagColor": "bg-red-100 text-red-700"
  },
  {
    "id": "n-1792550299820-56",
    "title": "2027年国考今起报名！广东地区计划招录2969人，岗位表来了",
    "summary": "2027年国考今起报名！广东地区计划招录2969人，岗位表来了  21财经",
    "date": "2026-10-14",
    "source": "综合报道",
    "tag": "招录动态",
    "tagColor": "bg-red-100 text-red-700"
  },
  {
    "id": "n-1792550299820-58",
    "title": "国考今起报名，计划招录3.57万人，首提严打“公考围岗”",
    "summary": "国考今起报名，计划招录3.57万人，首提严打“公考围岗”  川观新闻",
    "date": "2026-10-14",
    "source": "综合报道",
    "tag": "招录动态",
    "tagColor": "bg-red-100 text-red-700"
  }
];
