export interface NewsItem {
  id: string;
  title: string;
  summary: string;
  date: string;
  source: string;
  tag: string;
  tagColor: string;
}

export const hotNews: NewsItem[] = [
  {
    "id": "n-1788057457458-63",
    "title": "2026河南公考竞争加剧：五个变化告诉你，考公已经进入“精细竞争”时代",
    "summary": "2026河南公考竞争加剧：五个变化告诉你，考公已经进入“精细竞争”时代  手机网易网",
    "date": "2026-08-17",
    "source": "综合报道",
    "tag": "数据分析",
    "tagColor": "bg-orange-100 text-orange-700"
  },
  {
    "id": "n-1788057457139-0",
    "title": "国考、省考有何区别，两个都想考怎么准备？",
    "summary": "国考、省考有何区别，两个都想考怎么准备？  凤凰网",
    "date": "2026-08-15",
    "source": "综合报道",
    "tag": "招录动态",
    "tagColor": "bg-red-100 text-red-700"
  },
  {
    "id": "n-1788057457139-3",
    "title": "花生十三丨2027国省考直播课表（全）图一：笔试系统班（6月23-8月24号）图二：海海刷（8月25-9月30号）图三：两期套题班（10月6号-11月27号）6月22号开课仪式，6月23号正式开讲！[哈哈][哈哈][哈哈]#国考##省考##公务员考试##公务员# http://t.cn/AX6jEvuk",
    "summary": "花生十三丨2027国省考直播课表（全）图一：笔试系统班（6月23-8月24号）图二：海海刷（8月25-9月30号）图三：两期套题班（10月6号",
    "date": "2026-05-27",
    "source": "综合报道",
    "tag": "招录动态",
    "tagColor": "bg-red-100 text-red-700"
  },
  {
    "id": "n-1788057457458-56",
    "title": "北京公务员考试补录公告发布，187个职位招723人",
    "summary": "北京公务员考试补录公告发布，187个职位招723人  京报网",
    "date": "2026-05-07",
    "source": "综合报道",
    "tag": "招录动态",
    "tagColor": "bg-red-100 text-red-700"
  },
  {
    "id": "n-1788057457139-2",
    "title": "逾400万人参加公务员省考，未来竞争还会更激烈吗？",
    "summary": "逾400万人参加公务员省考，未来竞争还会更激烈吗？  证券时报",
    "date": "2026-03-15",
    "source": "综合报道",
    "tag": "数据分析",
    "tagColor": "bg-orange-100 text-orange-700"
  },
  {
    "id": "n-1788057457139-1",
    "title": "20余省份今举行公务员省考 年龄要求普遍放宽",
    "summary": "20余省份今举行公务员省考 年龄要求普遍放宽  中国日报网",
    "date": "2026-03-14",
    "source": "综合报道",
    "tag": "政策变化",
    "tagColor": "bg-blue-100 text-blue-700"
  },
  {
    "id": "n-1788057457139-27",
    "title": "#公务员考试##国考##省考# 张弓言语十二箭🏹思维导图 高清版PDF（全） ​",
    "summary": "#公务员考试##国考##省考# 张弓言语十二箭🏹思维导图 高清版PDF（全） ​  新浪网",
    "date": "2026-02-18",
    "source": "综合报道",
    "tag": "招录动态",
    "tagColor": "bg-red-100 text-red-700"
  },
  {
    "id": "n-1788057457139-24",
    "title": "#公务员考试##国考##省考# 大作文结构：袁东预制“开头”到底怎么写？ ​",
    "summary": "#公务员考试##国考##省考# 大作文结构：袁东预制“开头”到底怎么写？ ​  新浪网",
    "date": "2026-02-13",
    "source": "综合报道",
    "tag": "招录动态",
    "tagColor": "bg-red-100 text-red-700"
  }
];
