export interface NewsItem {
  id: string;
  title: string;
  summary: string;
  date: string;
  source: string;
  tag: string;
  tagColor: string;
}

export const hotNews: NewsItem[] = [
  {
    "id": "n-1785052796197-0",
    "title": "一文分清国考省考，报考不再纠结",
    "summary": "一文分清国考省考，报考不再纠结  手机网易网",
    "date": "2026-07-24",
    "source": "综合报道",
    "tag": "招录动态",
    "tagColor": "bg-red-100 text-red-700"
  },
  {
    "id": "n-1785052796197-2",
    "title": "2027年国考省考关键时间节点汇总",
    "summary": "2027年国考省考关键时间节点汇总  手机网易网",
    "date": "2026-07-17",
    "source": "综合报道",
    "tag": "招录动态",
    "tagColor": "bg-red-100 text-red-700"
  },
  {
    "id": "n-1785052796197-5",
    "title": "如果目标是当公务员，985、211和普通一本的区别，一张表说透了",
    "summary": "如果目标是当公务员，985、211和普通一本的区别，一张表说透了  手机网易网",
    "date": "2026-07-17",
    "source": "综合报道",
    "tag": "热点资讯",
    "tagColor": "bg-gray-100 text-gray-700"
  },
  {
    "id": "n-1785052796197-14",
    "title": "27河南应届生考公全攻略！一张图看懂应届国考、省考、事业单位备考黄金时间轴，别再盲目陪跑！",
    "summary": "27河南应届生考公全攻略！一张图看懂应届国考、省考、事业单位备考黄金时间轴，别再盲目陪跑！  手机网易网",
    "date": "2026-07-14",
    "source": "综合报道",
    "tag": "报考指南",
    "tagColor": "bg-green-100 text-green-700"
  },
  {
    "id": "n-1785052796616-89",
    "title": "《2026毕业季公考数据报告》发布：公职招录七年首次缩招，高校毕业生如何破局？",
    "summary": "《2026毕业季公考数据报告》发布：公职招录七年首次缩招，高校毕业生如何破局？  新浪财经",
    "date": "2026-06-11",
    "source": "综合报道",
    "tag": "招录动态",
    "tagColor": "bg-red-100 text-red-700"
  },
  {
    "id": "n-1785052796197-3",
    "title": "省考国考选华桢教育，蓄力一击成功上岸！",
    "summary": "省考国考选华桢教育，蓄力一击成功上岸！  中华网",
    "date": "2026-06-04",
    "source": "综合报道",
    "tag": "招录动态",
    "tagColor": "bg-red-100 text-red-700"
  },
  {
    "id": "n-1785052796197-7",
    "title": "#公务员备考[超话]##湖北省人事考试网##湖北省考# 今年必考时政✅神舟飞船系列航天员最全合集💙从神舟一号到神舟二十三号，中国航天人飞天筑梦，在浩瀚太空写下中国航天的灿烂诗篇。😭考公考编同学注意了！这些都是重要得公基常识时政考点，国考、省考、事业",
    "summary": "#公务员备考[超话]##湖北省人事考试网##湖北省考# 今年必考时政✅神舟飞船系列航天员最全合集💙从神舟一号到神舟二十三号，中国航天人飞天筑梦，在浩瀚太空写下中国航天的灿烂诗篇。😭考公考编同学注意了！这些都是重要得公基常识时政考点，国考、省考、事业  手机新浪网",
    "date": "2026-05-29",
    "source": "综合报道",
    "tag": "备考策略",
    "tagColor": "bg-cyan-100 text-cyan-700"
  },
  {
    "id": "n-1785052796197-4",
    "title": "#公务员考试##省考# 国考省考都90分的句号老师的经验贴",
    "summary": "#公务员考试##省考# 国考省考都90分的句号老师的经验贴  手机新浪网",
    "date": "2026-05-12",
    "source": "综合报道",
    "tag": "招录动态",
    "tagColor": "bg-red-100 text-red-700"
  }
];
