export interface NewsItem {
  id: string;
  title: string;
  summary: string;
  date: string;
  source: string;
  tag: string;
  tagColor: string;
}

export const hotNews: NewsItem[] = [
  {
    "id": "n-1793417174946-15",
    "title": "江苏省2027年度考试录用公务员工作即将启动",
    "summary": "江苏省2027年度考试录用公务员工作即将启动  江苏先锋",
    "date": "2026-10-28",
    "source": "综合报道",
    "tag": "热点资讯",
    "tagColor": "bg-gray-100 text-gray-700"
  },
  {
    "id": "n-1793417174946-17",
    "title": "计划招录1.08万余名 四川省2027年度公开考试录用公务员明日起开始报名",
    "summary": "计划招录1.08万余名 四川省2027年度公开考试录用公务员明日起开始报名  川观新闻",
    "date": "2026-10-28",
    "source": "综合报道",
    "tag": "招录动态",
    "tagColor": "bg-red-100 text-red-700"
  },
  {
    "id": "n-1793417174947-77",
    "title": "“10人报名，9人录取”……这里七级公务员考试竞争比仅1.1∶1",
    "summary": "“10人报名，9人录取”……这里七级公务员考试竞争比仅1.1∶1  아시아경제",
    "date": "2026-10-28",
    "source": "综合报道",
    "tag": "招录动态",
    "tagColor": "bg-red-100 text-red-700"
  },
  {
    "id": "n-1793417174946-18",
    "title": "国考报名过审人数7年来首次下降，防范“公考围岗”乱象效果显现",
    "summary": "国考报名过审人数7年来首次下降，防范“公考围岗”乱象效果显现  21财经",
    "date": "2026-10-27",
    "source": "综合报道",
    "tag": "招录动态",
    "tagColor": "bg-red-100 text-red-700"
  },
  {
    "id": "n-1793417174946-19",
    "title": "2027年国考报名减少近20万人，过审人数7年首降，最热岗位6000:1",
    "summary": "2027年国考报名减少近20万人，过审人数7年首降，最热岗位6000:1  新湖南",
    "date": "2026-10-27",
    "source": "综合报道",
    "tag": "招录动态",
    "tagColor": "bg-red-100 text-red-700"
  },
  {
    "id": "n-1793417174946-21",
    "title": "302.5万人过审竞争3.57万个国考名额，公考培训上市公司业绩承压",
    "summary": "302.5万人过审竞争3.57万个国考名额，公考培训上市公司业绩承压  虎嗅网",
    "date": "2026-10-27",
    "source": "综合报道",
    "tag": "数据分析",
    "tagColor": "bg-orange-100 text-orange-700"
  },
  {
    "id": "n-1793417174946-22",
    "title": "2027年国考345万人通过资格审查，平均报录比97：1",
    "summary": "2027年国考345万人通过资格审查，平均报录比97：1  新浪新闻_手机新浪网",
    "date": "2026-10-27",
    "source": "综合报道",
    "tag": "数据分析",
    "tagColor": "bg-orange-100 text-orange-700"
  },
  {
    "id": "n-1793417174946-47",
    "title": "345 万人通过审查，97 比 1 的竞争，确认别忘",
    "summary": "345 万人通过审查，97 比 1 的竞争，确认别忘|中央机关及其直属机构|国家公务员局|国考_新浪新闻  新浪网",
    "date": "2026-10-26",
    "source": "综合报道",
    "tag": "数据分析",
    "tagColor": "bg-orange-100 text-orange-700"
  }
];
