export interface NewsItem {
  id: string;
  title: string;
  summary: string;
  date: string;
  source: string;
  tag: string;
  tagColor: string;
}

export const hotNews: NewsItem[] = [
  {
    "id": "n-1792377104103-88",
    "title": "国考10月14日起报名！首提严打“公考围岗”、招录向基层倾斜 #国考今起报名（中央广播电视总台中国之声、中国新闻网）",
    "summary": "国考10月14日起报名！首提严打“公考围岗”、招录向基层倾斜 #国考今起报名（中央广播电视总台中国之声、中国新闻网）  搜狐",
    "date": "2026-10-17",
    "source": "综合报道",
    "tag": "招录动态",
    "tagColor": "bg-red-100 text-red-700"
  },
  {
    "id": "n-1792377104103-64",
    "title": "公务员考试，虚假报名700次，盗取5000条公民信息",
    "summary": "公务员考试，虚假报名700次，盗取5000条公民信息  搜狐网",
    "date": "2026-10-15",
    "source": "综合报道",
    "tag": "招录动态",
    "tagColor": "bg-red-100 text-red-700"
  },
  {
    "id": "n-1792377104103-65",
    "title": "国考报名开始，莫给“公考围岗”可乘之机",
    "summary": "国考报名开始，莫给“公考围岗”可乘之机  搜狐网",
    "date": "2026-10-15",
    "source": "综合报道",
    "tag": "招录动态",
    "tagColor": "bg-red-100 text-red-700"
  },
  {
    "id": "n-1792377104103-71",
    "title": "​2027年度国考今起报名，首推实名实人认证应对“公考围岗”，专家：确保考试公平，减少国家筛选成本",
    "summary": "​2027年度国考今起报名，首推实名实人认证应对“公考围岗”，专家：确保考试公平，减少国家筛选成本  finance.sina.com.cn",
    "date": "2026-10-15",
    "source": "综合报道",
    "tag": "招录动态",
    "tagColor": "bg-red-100 text-red-700"
  },
  {
    "id": "n-1792377104103-103",
    "title": "扬州65个岗位招110人！“国考”今起报名，新增“实名实人”认证",
    "summary": "扬州65个岗位招110人！“国考”今起报名，新增“实名实人”认证  凤凰网",
    "date": "2026-10-15",
    "source": "综合报道",
    "tag": "招录动态",
    "tagColor": "bg-red-100 text-red-700"
  },
  {
    "id": "n-1792377104102-56",
    "title": "国考招录两连降 公考培训进入“贴身战”",
    "summary": "国考招录两连降 公考培训进入“贴身战”  东方财富",
    "date": "2026-10-14",
    "source": "综合报道",
    "tag": "招录动态",
    "tagColor": "bg-red-100 text-red-700"
  },
  {
    "id": "n-1792377104102-57",
    "title": "国考今起报名，计划招录3.57万人，首提严打“公考围岗”",
    "summary": "国考今起报名，计划招录3.57万人，首提严打“公考围岗”  川观新闻",
    "date": "2026-10-14",
    "source": "综合报道",
    "tag": "招录动态",
    "tagColor": "bg-red-100 text-red-700"
  },
  {
    "id": "n-1792377104102-58",
    "title": "2027年国考今起报名！广东地区计划招录2969人，岗位表来了",
    "summary": "2027年国考今起报名！广东地区计划招录2969人，岗位表来了  21财经",
    "date": "2026-10-14",
    "source": "综合报道",
    "tag": "招录动态",
    "tagColor": "bg-red-100 text-red-700"
  }
];
