export interface NewsItem {
  id: string;
  title: string;
  summary: string;
  date: string;
  source: string;
  tag: string;
  tagColor: string;
}

export const hotNews: NewsItem[] = [
  {
    "id": "n-1785838481105-13",
    "title": "一文分清国考省考，报考不再纠结",
    "summary": "一文分清国考省考，报考不再纠结  手机网易网",
    "date": "2026-07-24",
    "source": "综合报道",
    "tag": "招录动态",
    "tagColor": "bg-red-100 text-red-700"
  },
  {
    "id": "n-1785838481105-14",
    "title": "【2027省考资料包】2026省考公务员资料大合集（最全汇总整理）http://t.cn/AXxLROH7【超级全】 网课+笔记讲义+题库 /历年真题答案解析「❤️ 省考资料合集最新汇总」 【公考名师合集】 汇总资料包「❤️ 省考资料合集最新汇总」 【公考名师合集】 汇总资料包「01.公考名师」",
    "summary": "【2027省考资料包】2026省考公务员资料大合集（最全汇总整理）http://t.cn/AXxLROH7【超级全】 网课+笔记讲义+题库 /历年真题答案解析「❤️ 省考资料合集最新汇总」 【公考名师合集】 汇总资料包「❤️ 省考资料合集最新汇总」 【公考名师合集】 汇总资料包「01.公考名师」  ",
    "date": "2026-07-22",
    "source": "综合报道",
    "tag": "备考策略",
    "tagColor": "bg-cyan-100 text-cyan-700"
  },
  {
    "id": "n-1785838481105-6",
    "title": "2027年国考省考关键时间节点汇总",
    "summary": "2027年国考省考关键时间节点汇总  手机网易网",
    "date": "2026-07-17",
    "source": "综合报道",
    "tag": "招录动态",
    "tagColor": "bg-red-100 text-red-700"
  },
  {
    "id": "n-1785838481105-16",
    "title": "如果目标是当公务员，985、211和普通一本的区别，一张表说透了",
    "summary": "如果目标是当公务员，985、211和普通一本的区别，一张表说透了  手机网易网",
    "date": "2026-07-17",
    "source": "综合报道",
    "tag": "热点资讯",
    "tagColor": "bg-gray-100 text-gray-700"
  },
  {
    "id": "n-1785838481417-92",
    "title": "《2026毕业季公考数据报告》发布：公职招录七年首次缩招，高校毕业生如何破局？",
    "summary": "《2026毕业季公考数据报告》发布：公职招录七年首次缩招，高校毕业生如何破局？  新浪财经",
    "date": "2026-06-11",
    "source": "综合报道",
    "tag": "招录动态",
    "tagColor": "bg-red-100 text-red-700"
  },
  {
    "id": "n-1785838481105-5",
    "title": "2027国考、省考全周期备考规划",
    "summary": "2027国考、省考全周期备考规划  新浪财经",
    "date": "2026-06-06",
    "source": "综合报道",
    "tag": "备考策略",
    "tagColor": "bg-cyan-100 text-cyan-700"
  },
  {
    "id": "n-1785838481105-11",
    "title": "省考国考选华桢教育，蓄力一击成功上岸！",
    "summary": "省考国考选华桢教育，蓄力一击成功上岸！  mtz.china.com",
    "date": "2026-06-04",
    "source": "综合报道",
    "tag": "招录动态",
    "tagColor": "bg-red-100 text-red-700"
  },
  {
    "id": "n-1785838481105-17",
    "title": "#公务员考试##国考##省考# 言语理解高频生僻词语成语积累📝自用整理",
    "summary": "#公务员考试##国考##省考# 言语理解高频生僻词语成语积累📝自用整理  sina.cn",
    "date": "2026-05-27",
    "source": "综合报道",
    "tag": "招录动态",
    "tagColor": "bg-red-100 text-red-700"
  }
];
