export interface NewsItem {
  id: string;
  title: string;
  summary: string;
  date: string;
  source: string;
  tag: string;
  tagColor: string;
}

export const hotNews: NewsItem[] = [
  {
    "id": "n-1785319995004-0",
    "title": "一文分清国考省考，报考不再纠结",
    "summary": "一文分清国考省考，报考不再纠结  手机网易网",
    "date": "2026-07-24",
    "source": "综合报道",
    "tag": "招录动态",
    "tagColor": "bg-red-100 text-red-700"
  },
  {
    "id": "n-1785319995004-2",
    "title": "2027年国考省考关键时间节点汇总",
    "summary": "2027年国考省考关键时间节点汇总  手机网易网",
    "date": "2026-07-17",
    "source": "综合报道",
    "tag": "招录动态",
    "tagColor": "bg-red-100 text-red-700"
  },
  {
    "id": "n-1785319995004-5",
    "title": "如果目标是当公务员，985、211和普通一本的区别，一张表说透了",
    "summary": "如果目标是当公务员，985、211和普通一本的区别，一张表说透了  手机网易网",
    "date": "2026-07-17",
    "source": "综合报道",
    "tag": "热点资讯",
    "tagColor": "bg-gray-100 text-gray-700"
  },
  {
    "id": "n-1785319995004-14",
    "title": "27河南应届生考公全攻略！一张图看懂应届国考、省考、事业单位备考黄金时间轴，别再盲目陪跑！",
    "summary": "27河南应届生考公全攻略！一张图看懂应届国考、省考、事业单位备考黄金时间轴，别再盲目陪跑！  手机网易网",
    "date": "2026-07-14",
    "source": "综合报道",
    "tag": "报考指南",
    "tagColor": "bg-green-100 text-green-700"
  },
  {
    "id": "n-1785319995398-96",
    "title": "《2026毕业季公考数据报告》发布：公职招录七年首次缩招，高校毕业生如何破局？",
    "summary": "《2026毕业季公考数据报告》发布：公职招录七年首次缩招，高校毕业生如何破局？  新浪财经",
    "date": "2026-06-11",
    "source": "综合报道",
    "tag": "招录动态",
    "tagColor": "bg-red-100 text-red-700"
  },
  {
    "id": "n-1785319995004-3",
    "title": "省考国考选华桢教育，蓄力一击成功上岸！",
    "summary": "省考国考选华桢教育，蓄力一击成功上岸！  中华网",
    "date": "2026-06-04",
    "source": "综合报道",
    "tag": "招录动态",
    "tagColor": "bg-red-100 text-red-700"
  },
  {
    "id": "n-1785319995004-6",
    "title": "#公务员考试##国考##省考# 言语理解高频生僻词语成语积累📝自用整理",
    "summary": "#公务员考试##国考##省考# 言语理解高频生僻词语成语积累📝自用整理  新浪网",
    "date": "2026-05-27",
    "source": "综合报道",
    "tag": "招录动态",
    "tagColor": "bg-red-100 text-red-700"
  },
  {
    "id": "n-1785319995004-4",
    "title": "#公务员考试##省考# 国考省考都90分的句号老师的经验贴",
    "summary": "#公务员考试##省考# 国考省考都90分的句号老师的经验贴  新浪网",
    "date": "2026-05-12",
    "source": "综合报道",
    "tag": "招录动态",
    "tagColor": "bg-red-100 text-red-700"
  }
];
