export interface NewsItem {
  id: string;
  title: string;
  summary: string;
  date: string;
  source: string;
  tag: string;
  tagColor: string;
}

export const hotNews: NewsItem[] = [
  {
    "id": "n-1790216586043-0",
    "title": "2027国考、省考全周期备考规划",
    "summary": "2027国考、省考全周期备考规划  新浪财经",
    "date": "2026-06-06",
    "source": "综合报道",
    "tag": "备考策略",
    "tagColor": "bg-cyan-100 text-cyan-700"
  },
  {
    "id": "n-1790216586043-1",
    "title": "省考国考选华桢教育，蓄力一击成功上岸！",
    "summary": "省考国考选华桢教育，蓄力一击成功上岸！  中华网",
    "date": "2026-06-04",
    "source": "综合报道",
    "tag": "招录动态",
    "tagColor": "bg-red-100 text-red-700"
  },
  {
    "id": "n-1790216586043-14",
    "title": "花生十三丨2027国省考直播课表（全）图一：笔试系统班（6月23-8月24号）图二：海海刷（8月25-9月30号）图三：两期套题班（10月6号-11月27号）6月22号开课仪式，6月23号正式开讲！[哈哈][哈哈][哈哈]#国考##省考##公务员考试##公务员# http://t.cn/AX6jEvuk",
    "summary": "花生十三丨2027国省考直播课表（全）图一：笔试系统班（6月23-8月24号）图二：海海刷（8月25-9月30号）图三：两期套题班（10月6号",
    "date": "2026-05-27",
    "source": "综合报道",
    "tag": "招录动态",
    "tagColor": "bg-red-100 text-red-700"
  },
  {
    "id": "n-1790216586043-2",
    "title": "#公务员考试##国考##省考# 判断推理18个秒杀技巧（自用版） ​",
    "summary": "#公务员考试##国考##省考# 判断推理18个秒杀技巧（自用版） ​  手机新浪网",
    "date": "2026-05-24",
    "source": "综合报道",
    "tag": "招录动态",
    "tagColor": "bg-red-100 text-red-700"
  },
  {
    "id": "n-1790216586043-5",
    "title": "#公务员考试##省考# 国考省考都90分的句号老师的经验贴",
    "summary": "#公务员考试##省考# 国考省考都90分的句号老师的经验贴  手机新浪网",
    "date": "2026-05-12",
    "source": "综合报道",
    "tag": "招录动态",
    "tagColor": "bg-red-100 text-red-700"
  },
  {
    "id": "n-1790216586434-53",
    "title": "北京公务员考试补录公告发布，187个职位招723人",
    "summary": "北京公务员考试补录公告发布，187个职位招723人  京报网",
    "date": "2026-05-07",
    "source": "综合报道",
    "tag": "招录动态",
    "tagColor": "bg-red-100 text-red-700"
  },
  {
    "id": "n-1790216586043-3",
    "title": "20余省份今举行公务员省考 年龄要求普遍放宽",
    "summary": "20余省份今举行公务员省考 年龄要求普遍放宽  中国日报网",
    "date": "2026-03-14",
    "source": "综合报道",
    "tag": "政策变化",
    "tagColor": "bg-blue-100 text-blue-700"
  },
  {
    "id": "n-1790216586043-20",
    "title": "#公务员考试##国考##省考# 申论大作文怎么快速找分论点",
    "summary": "#公务员考试##国考##省考# 申论大作文怎么快速找分论点  手机新浪网",
    "date": "2026-03-13",
    "source": "综合报道",
    "tag": "备考策略",
    "tagColor": "bg-cyan-100 text-cyan-700"
  }
];
