export interface NewsItem {
  id: string;
  title: string;
  summary: string;
  date: string;
  source: string;
  tag: string;
  tagColor: string;
}

export const hotNews: NewsItem[] = [
  {
    "id": "n-1787109210354-1",
    "title": "2027河南省考什么时候备考？国考与省考备考时间规划",
    "summary": "2027河南省考什么时候备考？国考与省考备考时间规划  手机网易网",
    "date": "2026-08-18",
    "source": "综合报道",
    "tag": "备考策略",
    "tagColor": "bg-cyan-100 text-cyan-700"
  },
  {
    "id": "n-1787109210663-83",
    "title": "2026河南公考竞争加剧：五个变化告诉你，考公已经进入“精细竞争”时代",
    "summary": "2026河南公考竞争加剧：五个变化告诉你，考公已经进入“精细竞争”时代  手机网易网",
    "date": "2026-08-17",
    "source": "综合报道",
    "tag": "数据分析",
    "tagColor": "bg-orange-100 text-orange-700"
  },
  {
    "id": "n-1787109210353-0",
    "title": "国考、省考有何区别，两个都想考怎么准备？",
    "summary": "国考、省考有何区别，两个都想考怎么准备？  凤凰网",
    "date": "2026-08-15",
    "source": "综合报道",
    "tag": "招录动态",
    "tagColor": "bg-red-100 text-red-700"
  },
  {
    "id": "n-1787109210354-7",
    "title": "国家公务员考试这十年",
    "summary": "国家公务员考试这十年  凤凰网",
    "date": "2026-06-29",
    "source": "综合报道",
    "tag": "热点资讯",
    "tagColor": "bg-gray-100 text-gray-700"
  },
  {
    "id": "n-1787109210354-4",
    "title": "#公务员考试##国考##省考# 逻辑填空｜三字比喻",
    "summary": "#公务员考试##国考##省考# 逻辑填空｜三字比喻  手机新浪网",
    "date": "2026-05-27",
    "source": "综合报道",
    "tag": "招录动态",
    "tagColor": "bg-red-100 text-red-700"
  },
  {
    "id": "n-1787109210354-9",
    "title": "花生十三丨2027国省考直播课表（全）图一：笔试系统班（6月23-8月24号）图二：海海刷（8月25-9月30号）图三：两期套题班（10月6号-11月27号）6月22号开课仪式，6月23号正式开讲！[哈哈][哈哈][哈哈]#国考##省考##公务员考试##公务员# http://t.cn/AX6jEvuk",
    "summary": "花生十三丨2027国省考直播课表（全）图一：笔试系统班（6月23-8月24号）图二：海海刷（8月25-9月30号）图三：两期套题班（10月6号",
    "date": "2026-05-27",
    "source": "综合报道",
    "tag": "招录动态",
    "tagColor": "bg-red-100 text-red-700"
  },
  {
    "id": "n-1787109210663-84",
    "title": "北京公务员考试补录公告发布，187个职位招723人",
    "summary": "北京公务员考试补录公告发布，187个职位招723人  京报网",
    "date": "2026-05-07",
    "source": "综合报道",
    "tag": "招录动态",
    "tagColor": "bg-red-100 text-red-700"
  },
  {
    "id": "n-1787109210354-5",
    "title": "聊聊邢台跃龙门公考，公务员笔试培训好用吗，口碑怎么样",
    "summary": "聊聊邢台跃龙门公考，公务员笔试培训好用吗，口碑怎么样  中华网科技频道",
    "date": "2026-03-19",
    "source": "综合报道",
    "tag": "备考策略",
    "tagColor": "bg-cyan-100 text-cyan-700"
  }
];
