export interface NewsItem {
  id: string;
  title: string;
  summary: string;
  date: string;
  source: string;
  tag: string;
  tagColor: string;
}

export const hotNews: NewsItem[] = [
  {
    "id": "n-1786762948021-6",
    "title": "2027国考、省考全周期备考规划",
    "summary": "2027国考、省考全周期备考规划  新浪财经",
    "date": "2026-06-06",
    "source": "综合报道",
    "tag": "备考策略",
    "tagColor": "bg-cyan-100 text-cyan-700"
  },
  {
    "id": "n-1786762948021-10",
    "title": "#公务员考试##国考##省考# 逻辑填空｜三字比喻",
    "summary": "#公务员考试##国考##省考# 逻辑填空｜三字比喻  新浪网",
    "date": "2026-05-27",
    "source": "综合报道",
    "tag": "招录动态",
    "tagColor": "bg-red-100 text-red-700"
  },
  {
    "id": "n-1786762948021-15",
    "title": "花生十三丨2027国省考直播课表（全）图一：笔试系统班（6月23-8月24号）图二：海海刷（8月25-9月30号）图三：两期套题班（10月6号-11月27号）6月22号开课仪式，6月23号正式开讲！[哈哈][哈哈][哈哈]#国考##省考##公务员考试##公务员# http://t.cn/AX6jEvuk",
    "summary": "花生十三丨2027国省考直播课表（全）图一：笔试系统班（6月23-8月24号）图二：海海刷（8月25-9月30号）图三：两期套题班（10月6号",
    "date": "2026-05-27",
    "source": "综合报道",
    "tag": "招录动态",
    "tagColor": "bg-red-100 text-red-700"
  },
  {
    "id": "n-1786762948376-61",
    "title": "北京公务员考试补录公告发布，187个职位招723人",
    "summary": "北京公务员考试补录公告发布，187个职位招723人  新浪财经",
    "date": "2026-05-07",
    "source": "综合报道",
    "tag": "招录动态",
    "tagColor": "bg-red-100 text-red-700"
  },
  {
    "id": "n-1786762948021-2",
    "title": "逾400万人参加公务员省考，未来竞争还会更激烈吗？",
    "summary": "逾400万人参加公务员省考，未来竞争还会更激烈吗？  stcn.com",
    "date": "2026-03-15",
    "source": "综合报道",
    "tag": "数据分析",
    "tagColor": "bg-orange-100 text-orange-700"
  },
  {
    "id": "n-1786762948020-1",
    "title": "20余省份今举行公务员省考 年龄要求普遍放宽",
    "summary": "20余省份今举行公务员省考 年龄要求普遍放宽  中国日报网",
    "date": "2026-03-14",
    "source": "综合报道",
    "tag": "政策变化",
    "tagColor": "bg-blue-100 text-blue-700"
  },
  {
    "id": "n-1786762948021-13",
    "title": "#公务员考试##国考##省考# 申论模板（县乡篇） ​",
    "summary": "#公务员考试##国考##省考# 申论模板（县乡篇） ​  新浪网",
    "date": "2026-02-04",
    "source": "综合报道",
    "tag": "备考策略",
    "tagColor": "bg-cyan-100 text-cyan-700"
  },
  {
    "id": "n-1786762948021-9",
    "title": "2026年国考、省考什么时候出成绩？附历年成绩查询时间/入口",
    "summary": "2026年国考、省考什么时候出成绩？附历年成绩查询时间/入口  QQ News",
    "date": "2026-01-07",
    "source": "综合报道",
    "tag": "招录动态",
    "tagColor": "bg-red-100 text-red-700"
  }
];
