export interface NewsItem {
  id: string;
  title: string;
  summary: string;
  date: string;
  source: string;
  tag: string;
  tagColor: string;
}

export const hotNews: NewsItem[] = [
  {
    "id": "n-1792895208505-59",
    "title": "2027国考报名截止，多职位数千人竞争一岗",
    "summary": "2027国考报名截止，多职位数千人竞争一岗  中国宁波网",
    "date": "2026-10-25",
    "source": "综合报道",
    "tag": "招录动态",
    "tagColor": "bg-red-100 text-red-700"
  },
  {
    "id": "n-1792895208505-64",
    "title": "2027国考报名结束 超330万人报名",
    "summary": "2027国考报名结束 超330万人报名  手机网易网",
    "date": "2026-10-24",
    "source": "综合报道",
    "tag": "招录动态",
    "tagColor": "bg-red-100 text-red-700"
  },
  {
    "id": "n-1792895208505-62",
    "title": "2027国考报名：新规落地，报名人数超百万",
    "summary": "2027国考报名：新规落地，报名人数超百万  京报网",
    "date": "2026-10-21",
    "source": "综合报道",
    "tag": "招录动态",
    "tagColor": "bg-red-100 text-red-700"
  },
  {
    "id": "n-1792895208505-63",
    "title": "2027国考报名：新规落地，报名人数超百万_北晚在线",
    "summary": "2027国考报名：新规落地，报名人数超百万_北晚在线  北晚在线",
    "date": "2026-10-21",
    "source": "综合报道",
    "tag": "招录动态",
    "tagColor": "bg-red-100 text-red-700"
  },
  {
    "id": "n-1792895208505-61",
    "title": "国考报名时间过半，热门岗位报录比超2800:1",
    "summary": "国考报名时间过半，热门岗位报录比超2800:1  封面新闻",
    "date": "2026-10-20",
    "source": "综合报道",
    "tag": "招录动态",
    "tagColor": "bg-red-100 text-red-700"
  },
  {
    "id": "n-1792895208506-117",
    "title": "国考10月14日起报名！首提严打“公考围岗”、招录向基层倾斜 #国考今起报名（中央广播电视总台中国之声、中国新闻网）",
    "summary": "国考10月14日起报名！首提严打“公考围岗”、招录向基层倾斜 #国考今起报名（中央广播电视总台中国之声、中国新闻网）  搜狐",
    "date": "2026-10-17",
    "source": "综合报道",
    "tag": "招录动态",
    "tagColor": "bg-red-100 text-red-700"
  },
  {
    "id": "n-1792895208506-77",
    "title": "解读丨2027年国考招录政策调整，有何深意？",
    "summary": "解读丨2027年国考招录政策调整，有何深意？  新湖南",
    "date": "2026-10-16",
    "source": "综合报道",
    "tag": "招录动态",
    "tagColor": "bg-red-100 text-red-700"
  },
  {
    "id": "n-1792895208506-81",
    "title": "国考报名首日总报名人数达20.9万人，出现“千里挑一”岗位",
    "summary": "国考报名首日总报名人数达20.9万人，出现“千里挑一”岗位  京报网",
    "date": "2026-10-16",
    "source": "综合报道",
    "tag": "招录动态",
    "tagColor": "bg-red-100 text-red-700"
  }
];
